{
  "description": "DIAC-1037 Request respondent evidence when detained - check sendDirectionDateDue ",
  "request": {
    "uri": "/asylum/ccdAboutToStart",
    "credentials": "CaseOfficer",
    "input": {
      "eventId": "requestRespondentEvidence",
      "state": "awaitingRespondentEvidence",
      "caseData": {
        "template": "minimal-appeal-submitted.json",
        "replacements": {
          "appellantInDetention": "Yes",
          "homeOfficeSearchStatus": "SUCCESS",
          "sendDirectionExplanation": null,
          "sendDirectionParties": null,
          "sendDirectionDateDue": null
        }
      }
    }
  },
  "expectation": {
    "status": 200,
    "errors": [],
    "caseData": {
      "template": "minimal-appeal-submitted.json",
      "replacements": {
        "sendDirectionExplanation": "A notice of appeal has been lodged against this decision.\nYou must now upload all documents to the Tribunal. The Tribunal will make them accessible to the other party. You have until the date indicated below to supply your bundle.\nThe bundle must comply with (i) Rule 24 of the Tribunal Procedure Rules 2014 and (ii) Practice Direction, Part 3, sections 7.1 - 7.4.\nSpecifically, the bundle must contain:\n- The explanation for refusal;\n- the deportation order and/or the notice of decision to make the order (if any);\n- Interview record (if any);\n- Appellant's representations (if any);\n- a copy of any relevant indictment; pre-sentence report and/or OASys/ARNS reports (if any);\n- a copy of the Appellant's criminal record (if any);\n- a copy of the certificate of conviction (if any);\n- a transcript of the Sentencing Judge's Remarks (if any).\n- a copy of any Parole Report or other document relating to the appellant's period in custody and/or release (if any);\n- a copy of any medical report (if any).\n\nParties must ensure they conduct proceedings with procedural rigour.\nThe Tribunal will not overlook breaches of the requirements of the Procedure Rules, Practice Statement or Practice Direction, nor failures to comply with directions issued by the Tribunal. Parties are reminded of the possible sanctions for non-compliance set out in paragraph 5.3 of the Practice Direction.",
        "sendDirectionParties": "respondent",
        "sendDirectionDateDue": "{$TODAY+7}"
      }
    }
  }
}
