{
  "description": "DIAC-1078 Request respondent review when detained - check sendDirectionDateDue ",
  "request": {
    "uri": "/asylum/ccdAboutToStart",
    "credentials": "CaseOfficer",
    "input": {
      "eventId": "requestRespondentReview",
      "state": "awaitingRespondentReview",
      "caseData": {
        "template": "minimal-appeal-submitted.json",
        "replacements": {
          "appellantInDetention": "Yes",
          "homeOfficeSearchStatus": "SUCCESS",
          "sendDirectionExplanation": null,
          "sendDirectionParties": null,
          "sendDirectionDateDue": null
        }
      }
    }
  },
  "expectation": {
    "status": 200,
    "errors": [],
    "caseData": {
      "template": "minimal-appeal-submitted.json",
      "replacements": {
        "sendDirectionExplanation": "By the date below you must review the appellant’s ASA and bundle.\nThe review must comply with (i) Rule 24A (3) of the Tribunal Procedure Rules 2014 and (ii) Practice Direction (1.11.2024) Part 2, section 2.1 (e), Part 3, sections 7.11 – 7.12. Specifically, the review must:\n\n- be meaningful.\n- explain whether you agree that the schedule of disputed issues is correct. If not, the review must set out the correct list of disputed issues, including whether there are any further issues that the respondent wishes to raise.\n- state whether you oppose or accept the appellant’s position on each issue and why.\n- cross-reference your submissions to paragraphs in the decision under appeal, pages in the respondent’s bundle, any country information evidence schedule, and/or any additional evidence relied upon.\n- specify which, if any, witnesses you intend to cross-examine and if you do not intend to cross-examine a witness, outline any objections to that witness’s statement being read by a judge.\n- address whether the appeal should be allowed on any ground if the appellant and/or their key witnesses are found to be credible according to the applicable standard of proof.\n- identify whether you are prepared to withdraw the decision (or part of it).\n- state whether the appeal can be resolved without a hearing.\n- not exceed 6 pages unless reasons are submitted in an accompanying application.\n- not contain standard or pro-forma paragraphs.\n- provide the name of the author of the review and the date.\n\nParties must ensure they conduct proceedings with procedural rigour. The Tribunal will not overlook breaches of the requirements of the Procedure Rules, Practice Statement or Practice Direction, nor failures to comply with directions issued by the Tribunal. Parties are reminded of the sanctions for non-compliance set out in paragraph 5.3 of the Practice Direction of 01.11.24.",
        "sendDirectionParties": "respondent",
        "sendDirectionDateDue": "{$TODAY+7}"
      }
    }
  }
}