{
  "description": "DIAC-1348 Request case building direction to legal representative - Detained - AiP Manual",
  "request": {
    "uri": "/asylum/ccdAboutToStart",
    "credentials": "CaseOfficer",
    "input": {
      "eventId": "requestCaseBuilding",
      "state": "awaitingRespondentEvidence",
      "caseData": {
        "template": "minimal-appeal-submitted.json",
        "replacements": {
          "isAdmin": "Yes",
          "appellantInDetention": "Yes",
          "appellantsRepresentation": "Yes",
          "homeOfficeSearchStatus": "SUCCESS",
          "sendDirectionExplanation": null,
          "sendDirectionParties": null,
          "sendDirectionDateDue": null
        }
      }
    }
  },
  "expectation": {
    "status": 200,
    "errors": [],
    "caseData": {
      "template": "minimal-appeal-submitted.json",
      "replacements": {
        "sendDirectionExplanation": "The Home Office has uploaded their bundle of evidence.\n\nYou must now submit an explanation of your case, also referred to as the Appellant’s Explanation of Case (AEC), and a bundle of evidence.\n\nThe AEC should include the following:\n\n  1. A short summary of your case including important dates.\n  2. A list of things in the Home Office refusal letter that you do not agree with and why you do not agree with them.\n\nYour bundle of evidence should include:\n\n  1. An index – setting out each document and its page number.\n  2. A witness statement by you, the appellant.\n  3. A witness statement by any other person who is going to be a witness at the hearing of the appeal.\n\n  - Everybody who is going to be a witness at the hearing needs a witness statement.\n  - A witness statement is a document containing everything relevant the witness can tell the Tribunal.\n  - Witnesses will not be allowed to add to their statements unless the Tribunal agrees.\n  - Witness statements should be typed if possible.\n  - They must be in English.\n  - They must have paragraph numbers and page numbers.\n  - They must set out events, usually in the order they happened.\n  - All witness statements must be signed and dated.\n  - At the hearing, the Tribunal will read the witness statements. Witnesses may be asked questions about their statements by the other side and the Tribunal.\n\n  4. Any evidence or documents you wish to rely on in support of your appeal. This may include official documents, relationship evidence, criminal evidence, financial documents, medical evidence and/or country evidence. This is not an exhaustive list; your evidence will depend on the nature of your individual case.\n  5. If any documents are not in English, they must be translated into English by a translator. This translator must be approved by an official body. The translation must be certified, the translator must sign, stamp, and date it to confirm it’s a true and accurate copy of the original text.\n\nIf you fail to submit an explanation of your case (AEC) and a bundle of evidence by the date below, you will need to request the permission of a Judge to rely on late evidence and you will have to provide an explanation for the delay.\n\nThis decision is made by a Legal Officer in exercise of a specified power granted by the Senior President of Tribunals under rules 3(1) and (2) of the Tribunals Procedure (First-tier Tribunal) (Immigration and Asylum Chamber) Rules 2014. You may within 14 days of the date of this decision apply in writing to the Tribunal for the decision to be considered afresh by a judge under rule 3(4).",
        "sendDirectionParties": "legalRepresentative",
        "sendDirectionDateDue": "{$TODAY+28}"
      }
    }
  }
}
