{
  "description": "DIAC-1049 Request case building direction to legal representative - detained",
  "request": {
    "uri": "/asylum/ccdAboutToStart",
    "credentials": "CaseOfficer",
    "input": {
      "eventId": "requestCaseBuilding",
      "state": "awaitingRespondentEvidence",
      "caseData": {
        "template": "minimal-appeal-submitted.json",
        "replacements": {
          "appellantInDetention": "Yes",
          "homeOfficeSearchStatus": "SUCCESS",
          "sendDirectionExplanation": null,
          "sendDirectionParties": null,
          "sendDirectionDateDue": null
        }
      }
    }
  },
  "expectation": {
    "status": 200,
    "errors": [],
    "caseData": {
      "template": "minimal-appeal-submitted.json",
      "replacements": {
        "sendDirectionExplanation": "You must now build your case to enable the respondent to conduct a thorough review of the appeal.\n\nBy the date indicated below the Appellant is directed to:\n\n1. Upload an Appeal Skeleton Argument (“ASA”). The form and content of this ASA must comply with the terms of Practice Direction, Part 3.\n\n   Specifically, the ASA must\n\n   - be no more than 12 pages of numbered paragraphs.\n\n   - be set out in three distinct parts, to include:\n      i) a concise summary of the appellant’s case;\n      ii) a schedule of the disputed issues;\n      iii) the appellant’s brief submissions on each of those issues, which explain why the issues should be resolved in the appellant’s favour.\n\n   - include the name of the author of the ASA and the date on which it was prepared.\n\n2. The Appellant must, by the same date, upload an indexed and paginated bundle of all evidence which must comply with the Practice Direction. This includes:\n\n   - Witness statements\n\n   - Evidence relevant to the issues set out within the ASA\n\n   - Expert evidence or country information evidence\n\nParties must ensure they conduct proceedings with procedural rigour.\n\nThe Tribunal will not overlook breaches of the requirements of the Procedure Rules, Practice Statement or Practice Direction, nor failures to comply with directions issued by the Tribunal. Parties are reminded of the possible sanctions for non-compliance set out in paragraph 5.3 of the Practice Direction.\n",
        "sendDirectionParties": "legalRepresentative",
        "sendDirectionDateDue": "{$TODAY+28}"
      }
    }
  }
}
