{
  "description": "RIA-892-RIA-2694 Request respondent evidence - prefill case details",
  "request": {
    "uri": "/asylum/ccdAboutToStart",
    "credentials": "CaseOfficer",
    "input": {
      "eventId": "requestRespondentEvidence",
      "state": "awaitingRespondentEvidence",
      "caseData": {
        "template": "minimal-appeal-submitted.json",
        "replacements": {
          "homeOfficeSearchStatus": "SUCCESS",
          "sendDirectionExplanation": null,
          "sendDirectionParties": null,
          "sendDirectionDateDue": null
        }
      }
    }
  },
  "expectation": {
    "status": 200,
    "errors": [],
    "caseData": {
      "template": "minimal-appeal-submitted.json",
      "replacements": {
        "sendDirectionExplanation": "A notice of appeal has been lodged against this decision.\n\nBy the date indicated below the respondent is directed to supply the documents:\n\nThe bundle must comply with (i) Rule 23 or Rule 24 of the Tribunal Procedure Rules 2014 (as applicable) and (ii) Practice Direction (1.11.2024) Part 3, sections 7.1 - 7.4. Specifically, the bundle must contain:\n\n- the notice of decision appealed against.\n- any other document provided to the appellant giving reasons for that decision.\n- any evidence or material relevant to the disputed issues.\n- any statements of evidence.\n- the application form.\n- any record of interview with the appellant in relation to the decision being appealed.\n- any previous decision(s) of the Tribunal and Upper Tribunal (IAC) relating to the appellant.\n- any other unpublished documents on which you rely.\n- the notice of any other appealable decision made in relation to the appellant.\n\nWhere the appeal involves deportation, you must also include the following evidence:\n\n- a copy of the Certificate of Conviction.\n- a copy of any indictment/charge.\n- a transcript of the Sentencing Judge's Remarks.\n- a copy of any Pre-Sentence Report.\n- a copy of the appellant's criminal record.\n- a copy of any Parole Report or other document relating to the appellant's period in custody and/or release.\n- a copy of any mental health report.\n\nParties must ensure they conduct proceedings with procedural rigour. The Tribunal will not overlook breaches of the requirements of the Procedure Rules, Practice Statement or Practice Direction, nor failures to comply with directions issued by the Tribunal. Parties are reminded of the sanctions for non-compliance set out in paragraph 5.3 of the Practice Direction of 01.11.24.",
        "sendDirectionParties": "respondent",
        "sendDirectionDateDue": "{$TODAY+14}"
      }
    }
  }
}
